
MLP:

Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 4356)]            0         
_________________________________________________________________
flatten (Flatten)            (None, 4356)              0         
_________________________________________________________________
dense (Dense)                (None, 1024)              4461568   
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 360)               369000    
=================================================================
Total params: 5,880,168
Trainable params: 5,880,168
Non-trainable params: 0


CNN:

------------------------------------------------------------------------------------------------
InceptionV3                     (None, 4, 4, 2048)   0                       
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 2048)         0           mixed10[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         2098176     global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 360)          369000      dropout_1[0][0]                  
==================================================================================================
Total params: 25,319,560
Trainable params: 25,285,128
Non-trainable params: 34,432
__________________________________


HogPlusCNN:
__________________________________________________________________________________________________
mixed10 (Concatenate)           (None, 4, 4, 2048)   0           activation_85[0][0]              
                                                                 mixed9_1[0][0]                   
                                                                 concatenate_1[0][0]              
                                                                 activation_93[0][0]              
__________________________________________________________________________________________________
HOG_Features (InputLayer)       [(None, 4356)]       0                                            
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 2048)         0           mixed10[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 4356)         0           HOG_Features[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 6404)         0           global_average_pooling2d[0][0]   
                                                                 flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         6558720     concatenate_2[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 360)          369000      dropout_1[0][0]                  
==================================================================================================
Total params: 29,780,104
Trainable params: 29,745,672
Non-trainable params: 34,432


CNN: 
__________________________________________________________________________________________________
DenseNet121                     (None, 6, 6, 1024)   0           bn[0][0]                         
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1024)         0           relu[0][0]                       
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         1049600     global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 360)          369000      dropout_1[0][0]                  
==================================================================================================
Total params: 9,505,704
Trainable params: 9,422,056
Non-trainable params: 83,648
______________________________

